const metalRecyclingPlaces = [
  {
    name: 'Пункт приема метала,Будайский проезд, 11А',
    coordinates: [37.668775, 55.837618],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала,2-й Нагатинский проезд, 6В',
    coordinates: [37.634479, 55.673327],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала,улица Руставели, 2Ас1',
    coordinates: [37.581612, 55.810753],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала,улица Неверовского, 6',
    coordinates: [37.512804, 55.740934],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала,улица Подольских Курсантов, 22Ас26',
    coordinates: [37.635628, 55.598975],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала,улица Матросская Тишина, 1Ас72',
    coordinates: [37.688414, 55.783256],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, Шоссейная улица, 90с1',
    coordinates: [37.707548, 55.664252],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, Краснодонская улица, 9/2',
    coordinates: [37.759479, 55.691014],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, Никопольская улица, 6с12',
    coordinates: [37.621058, 55.582477],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, 1-й Рощинский проезд',
    coordinates: [37.606695, 55.709039],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, 1-я улица Энтузиастов, 6с9',
    coordinates: [37.724039, 55.75016],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, Перовский проезд, 54с7',
    coordinates: [37.707961, 55.742918],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, Огородный проезд, 4с1',
    coordinates: [37.607107, 55.811963],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, 2-я Лыковская улица, 77',
    coordinates: [37.397936, 55.791154],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, Никопольская улица, 6с7',
    coordinates: [37.620681, 55.582029],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, Промышленный проезд, 7с3',
    coordinates: [37.509346, 55.739867],
    description: 'Метал'
  },
  {
    name: 'Пункт приема метала, Авиамоторная улица, 67/8с8',
    coordinates: [37.722949, 55.73755],
    description: 'Метал'
  }
]
