const plasticRecyclingPlaces = [
  {
    name: 'Пункт приема пластмассы, 1-я улица Измайловского Зверинца, 19Ас7',
    coordinates: [37.746136, 55.778181],
    description: 'Пластик'
  },
  {
    name: 'Пункт приема пластмассы, Кавказский бульвар, 52А',
    coordinates: [37.64466, 55.63044],
    description: 'Пластик'
  },
  {
    name: 'Пункт приема пластмассы, Солнечногорский проезд, 4Ас1',
    coordinates: [37.527091, 55.859297],
    description: 'Пластик'
  },
  {
    name: 'Пункт приема пластмассы, Ташкентская улица, 28с1',
    coordinates: [37.806116, 55.699362],
    description: 'Пластик'
  },
  {
    name: 'Пункт приема пластмассы, Солнечногорский проезд, 4Ас1',
    coordinates: [37.527905, 55.859195],
    description: 'Пластик'
  },
  {
    name:
      'Пункт приема пластмассы, Московская обл., г.Люберцы, Проектируемый пр-д 4296 с4 ',
    coordinates: [37.943472, 55.674489],
    description: 'Пластик'
  },
  {
    name: 'Пункт приема пластмассы, Кусковская улица, 18',
    coordinates: [37.782683, 55.73852],
    description: 'Пластик'
  },
  {
    name: 'Пункт приема пластмассы, Потаповский переулок, 5с2',
    coordinates: [37.640206, 55.761828],
    description: 'Пластик'
  }
]
