mapboxgl.accessToken = 'pk.eyJ1Ijoic21zYWxpc2NoZXZhMjIiLCJhIjoiY2xmNzF4eWZsMDJzODQ0bnZnNXFiYmd0cyJ9.TXlxfRR7GHif7rBbRWqOZw'; // замените на свой токен Mapbox

var map = new mapboxgl.Map({
  container: document.querySelector('.Q_Map'),
  style: 'mapbox://styles/smsalischeva22/clf78rxpu00do01mltwb5aj5r',
  center: [37.618423, 55.751244],
  zoom: 10
});
var categorySelector = document.querySelector('#category-selector');
var glassButton = document.querySelector('#glass');
var markers = [];
var glassRecyclingPlaces = [{
  name: 'Москва, Мосфильмовская улица, 80А',
  coordinates: [37.499812, 55.707162],
  description: 'Стеклобой'
}, {
  name: 'Москва, Мичуринский проспект, 9к2',
  coordinates: [37.509002, 55.701506],
  description: 'Стеклобой'
}, {
  name: 'Москва, Мичуринский проспект, 19к1',
  coordinates: [37.505283, 55.69798],
  description: 'Стеклобой'
}, {
  name: 'Москва, Мичуринский проспект, 25к2',
  coordinates: [37.504564, 55.696316],
  description: 'Стеклобой'
}, {
  name: 'Москва, Ленинский проспект, 30',
  coordinates: [37.58385, 55.710641],
  description: 'Стеклобой'
}, {
  name: 'Москва, улица Вавилова, 2',
  coordinates: [37.591943, 55.709637],
  description: 'Стеклобой'
}, {
  name: 'Москва, Расторгуевский переулок, 16с1',
  coordinates: [37.565156, 55.765959],
  description: 'Колокольчики'
}, {
  name: 'Москва, улица Хамовнический Вал',
  coordinates: [37.563045, 55.720727],
  description: 'Колокольчики'
}, {
  name: 'Москва, улица Дурова, 3/13',
  coordinates: [37.62064201324459, 55.78080415402429],
  description: 'Колокольчики'
}, {
  name: 'Москва, парк Красногвардейские пруды',
  coordinates: [37.545087, 55.760996],
  description: 'Колокольчики'
}, {
  name: 'Гомель, Фестивальный парк',
  coordinates: [30.943117, 52.408814],
  description: 'Колокольчики'
}, {
  name: 'Москва, Кутузовский проспект, 16',
  coordinates: [37.553576, 55.747282],
  description: 'Колокольчики'
}, {
  name: 'Гомель, Фестивальный парк',
  coordinates: [30.943117, 52.408814],
  description: 'Колокольчики'
}, {
  name: 'Бережковская наб., 22 (у Роскосмоса)',
  coordinates: [37.455753, 55.723431],
  description: 'Колокольчики'
}, {
  name: 'Cквер за «Mc Donals’s» по ул. Б. Дорогомиловская',
  coordinates: [37.550357, 55.747111],
  description: 'Колокольчики'
}, {
  name: 'Пруд у Красных Зорь, д. 47',
  coordinates: [37.7635, 55.8707],
  description: 'Колокольчики'
}, {
  name: 'Парк Сквер рядом с ул. Кастанаевская, д.51к3',
  coordinates: [37.6757, 55.7316],
  description: 'Колокольчики'
}, {
  name: 'Парк Ж/д станция Очаково',
  coordinates: [37.4079, 55.6535],
  description: 'Колокольчики'
}, {
  name: 'Парк Большой Очаковский пруд',
  coordinates: [37.4116, 55.6473],
  description: 'Колокольчики'
}, {
  name: 'ТПУ метро Озерная, напротив выхода №2',
  coordinates: [37.4337, 55.6251],
  description: 'Колокольчики'
}, {
  name: 'ТПУ метро Озерная, напротив выхода №3',
  coordinates: [37.4335, 55.6245],
  description: 'Колокольчики'
}, {
  name: 'ТПУ метро Озерная, напротив выхода №4',
  coordinates: [37.434, 55.6241],
  description: 'Колокольчики'
}, {
  name: 'Парк Парк Удальцовские пруды',
  coordinates: [37.4951, 55.7215],
  description: 'Колокольчики'
}, {
  name: 'Парк Пруды на проспекте Вернадского (пр. Вернадского, д.59)',
  coordinates: [37.4979, 55.6769],
  description: 'Колокольчики'
}, {
  name: 'Парк Новопеределкино, парк около ул. Лукинская, д.14к1 и д.18к1, две площадки',
  coordinates: [37.3588, 55.6241],
  description: 'Колокольчики'
}, {
  name: 'Парк Новопеределкино, у дома по ул. Новопеределкинская, д. 14',
  coordinates: [37.3573, 55.6241],
  description: 'Колокольчики'
}, {
  name: 'Екатерининский сквер',
  coordinates: [30.326614, 59.93992],
  description: 'Колокольчики'
}, {
  name: 'Красная Пресня (основная)',
  coordinates: [37.558834, 55.774967],
  description: 'Колокольчики'
}, {
  name: 'Красногвардейские пруды',
  coordinates: [37.792711, 55.82121],
  description: 'Колокольчики'
}, {
  name: 'Сквер Девичье поле',
  coordinates: [37.577764, 55.761425],
  description: 'Колокольчики'
}, {
  name: 'Сквер у Калитниковского пруда',
  coordinates: [37.651715, 55.725357],
  description: 'Колокольчики'
}, {
  name: 'Парк «Фестивальный»',
  coordinates: [37.494865, 55.855023],
  description: 'Колокольчики'
}, {
  name: 'Сквер у Крымской эстакады',
  coordinates: [37.606139, 55.733073],
  description: 'Колокольчики'
}, {
  name: 'Репинский сквер, Болотная площадь',
  coordinates: [37.616334, 55.742525],
  description: 'Колокольчики'
}, {
  name: 'Рублевский сквер',
  coordinates: [37.406287, 55.754673],
  description: 'Колокольчики'
}, {
  name: 'Расторгуевский переулок, 16с1',
  coordinates: [37.558834, 55.774967],
  description: 'Колокольчики'
}, {
  name: 'Парк Бережковская наб., 22 (у Роскосмоса)',
  coordinates: [37.5169, 55.7403],
  description: 'Колокольчики'
}, {
  name: 'Парк Cквер за "Мак Доналс" по ул. Б. Дорогомиловская',
  coordinates: [37.5609, 55.7476],
  description: 'Колокольчики'
}, {
  name: 'Парк Пешеходная зона по ул. М. Дорогомиловская',
  coordinates: [37.5629, 55.7489],
  description: 'Колокольчики'
}, {
  name: 'Парк Кутузовский пр., 16',
  coordinates: [37.4778, 55.7391],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Сквер у дома по ул. Удальцова, 85А',
  coordinates: [37.4661, 55.7143],
  description: 'Колокольчики'
}, {
  name: 'Парк Парк у префектуры, включая зеленые территории, по ул. И. Франко',
  coordinates: [37.5262, 55.7472],
  description: 'Колокольчики'
}, {
  name: 'Парк ул. Василия Ботылева, д.45 (церковь)',
  coordinates: [37.5034, 55.6924],
  description: 'Колокольчики'
}, {
  name: 'Парк Пешеходная зона, обнаруженная к Можайскому пруду (Беловежский пруд)',
  coordinates: [37.4636, 55.7475],
  description: 'Колокольчики'
}, {
  name: 'Парк Пруд у Красных Зорь, д. 47',
  coordinates: [37.4202, 55.7389],
  description: 'Колокольчики'
}, {
  name: 'Парк Сквер рядом с ул. Кастанаевская, д.51к3',
  coordinates: [37.6087, 55.7296],
  description: 'Колокольчики'
}, {
  name: 'Парк Ж/д станция Очаково',
  coordinates: [37.4093, 55.6843],
  description: 'Колокольчики'
}, {
  name: 'Парк Большой Очаковский пруд',
  coordinates: [37.3999, 55.6699],
  description: 'Колокольчики'
}, {
  name: 'ТПУ метро Озерная, напротив выхода №2',
  coordinates: [37.4357, 55.6226],
  description: 'Колокольчики'
}, {
  name: 'ТПУ метро Озерная, напротив выхода №3',
  coordinates: [37.436703, 55.684152],
  description: 'Колокольчики'
}, {
  name: 'ТПУ метро Озерная, напротив выхода №4',
  coordinates: [37.435995, 55.683813],
  description: 'Колокольчики'
}, {
  name: 'Парк Удальцовские пруды',
  coordinates: [37.454737, 55.697717],
  description: 'Колокольчики'
}, {
  name: 'Пруды на проспекте Вернадского (пр. Вернадского, д.59)',
  coordinates: [37.499914, 55.673651],
  description: 'Колокольчики'
}, {
  name: 'Новопеределкино, парк около ул. Лукинская, д.14к1 и д.18к1, две площадки',
  coordinates: [37.370463, 55.638111],
  description: 'Колокольчики'
}, {
  name: 'Новопеределкино, у дома по ул. Новопеределкинская, д. 14',
  coordinates: [37.366634, 55.642767],
  description: 'Колокольчики'
}, {
  name: 'Парк Центральный: спуск к Большому Солнцевскому пруду, у остановки',
  coordinates: [37.420811, 55.792029],
  description: 'Колокольчики'
}, {
  name: 'Озеро «Мещерское»',
  coordinates: [37.444526, 55.610852],
  description: 'Колокольчики'
}, {
  name: 'у Большого Солнцевского пруда по ул. Попутная',
  coordinates: [37.414408, 55.804394],
  description: 'Колокольчики'
}, {
  name: 'Парк Олимпийской Деревни (у входа в парк)',
  coordinates: [37.538392, 55.737594],
  description: 'Колокольчики'
}, {
  name: 'Парк «Никулино», сквер у Генштаба',
  coordinates: [37.426218, 55.667244],
  description: 'Колокольчики'
}, {
  name: 'Пересечение ул. Минская и ул. Олеко Дундича',
  coordinates: [37.544262, 55.735245],
  description: 'Колокольчики'
}, {
  name: 'Парковая зона вдоль линии метро от ст. м. Пионерская до ст. м. Филевский парк.',
  coordinates: [37.483, 55.736],
  description: 'Колокольчики'
}, {
  name: 'Сквер на ул. Кременчугской',
  coordinates: [37.56, 55.733],
  description: 'Колокольчики'
}, {
  name: 'Университетская площадь, Воробьевы горы',
  coordinates: [37.532, 55.702],
  description: 'Колокольчики'
}, {
  name: 'Рассказовская ул,, ориентир д.20, лесопарк',
  coordinates: [37.324, 55.638],
  description: 'Колокольчики'
}, {
  name: 'Парк Озерная аллея дом 10',
  coordinates: [37.681623, 55.701016],
  description: 'Колокольчики'
}, {
  name: 'Площадь Юности',
  coordinates: [37.543011, 55.858086],
  description: 'Колокольчики'
}, {
  name: 'Зеленоград, район Матушкино, 1 мкр., зона отдыха пруд Быково болото',
  coordinates: [37.166491, 55.994745],
  description: 'Колокольчики'
}, {
  name: 'Зеленоград, район Старое Крюково, пешеходная зона в 8-м микрорайоне',
  coordinates: [37.145782, 55.978745],
  description: 'Колокольчики'
}, {
  name: 'Парк Дубовой рощи «Маяк»',
  coordinates: [37.607251, 55.663184],
  description: 'Колокольчики'
}, {
  name: 'Парк Салют',
  coordinates: [37.580255, 55.677932],
  description: 'Колокольчики'
}, {
  name: 'Парк «Захарково»',
  coordinates: [37.846512, 55.611791],
  description: 'Колокольчики'
}, {
  name: 'Сквер Кленовый',
  coordinates: [37.569251, 55.880113],
  description: 'Колокольчики'
}, {
  name: 'Плодовый сад по Неманскому проезду',
  coordinates: [37.534383, 55.749393],
  description: 'Колокольчики'
}, {
  name: 'Парк «Северное Тушино»',
  coordinates: [37.437292, 55.870979],
  description: 'Колокольчики'
}, {
  name: 'Сквер Соколинная гора',
  coordinates: [37.484348, 55.780445],
  description: 'Колокольчики'
}, {
  name: 'Сквер Соколинная гора',
  coordinates: [37.479367, 55.779354],
  description: 'Колокольчики'
}, {
  name: 'Бульвар генерала Карбышева 21/37',
  coordinates: [37.499919, 55.7763],
  description: 'Колокольчики'
}, {
  name: 'Бульвар генерала Карбышева д.2',
  coordinates: [37.501455, 55.774031],
  description: 'Колокольчики'
}, {
  name: 'Парк Ул. Митинская, 36',
  coordinates: [37.363, 55.857],
  description: 'Колокольчики'
}, {
  name: 'Парк Ул. Митинская, 48',
  coordinates: [37.365, 55.858],
  description: 'Колокольчики'
}, {
  name: 'Парк Пятницкое ш., 34с1',
  coordinates: [37.357, 55.849],
  description: 'Колокольчики'
}, {
  name: 'Парк Сквер по ул. Кулакова д.8',
  coordinates: [37.423, 55.793],
  description: 'Колокольчики'
}, {
  name: 'Парк Сквер по ул. Кулакова (Исаковского д.6 к 2)',
  coordinates: [37.425, 55.796],
  description: 'Колокольчики'
}, {
  name: 'Парк Сквер Таллинский (Таллинская 8)',
  coordinates: [37.431, 55.828],
  description: 'Колокольчики'
}, {
  name: 'Парк парк долины реки Химка (Большая набережная 1)',
  coordinates: [37.451, 55.896],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Волоколамская (метро)',
  coordinates: [37.382, 55.835],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Строгино (метро)',
  coordinates: [37.402, 55.803],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Сходненская (метро)',
  coordinates: [37.439, 55.855],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Тушинская (метро, платформа) (Стратонавтов, д.5Г)',
  coordinates: [37.436, 55.827],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Пятницкое ш. (метро)',
  coordinates: [37.353, 55.854],
  description: 'Колокольчики'
}, {
  name: 'Пойма реки Яузы в районе Свиблово Лазоревый, 12',
  coordinates: [37.635186, 55.868093],
  description: 'Колокольчики'
}, {
  name: 'Пойма реки Яузы в районе Свиблово, Лазоревый, 20',
  coordinates: [37.633096, 55.870194],
  description: 'Колокольчики'
}, {
  name: 'ВДНХ (метро)',
  coordinates: [37.640722, 55.821146],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Останкино',
  coordinates: [37.614058, 55.811681],
  description: 'Колокольчики'
}, {
  name: 'Академика Королева 10 (заезд с ул. Валентины Леонтьевой)',
  coordinates: [37.621511, 55.826263],
  description: 'Колокольчики'
}, {
  name: 'Пр-т Мира 109 (киноконцертный зал Космос)',
  coordinates: [37.632145, 55.799347],
  description: 'Колокольчики'
}, {
  name: 'Парк спорта «Яуза» (Докукина 11с2)',
  coordinates: [37.730605, 55.788389],
  description: 'Колокольчики'
}, {
  name: 'Парк спорта «Яуза» (пр-т Мира 161)',
  coordinates: [37.635539, 55.817048],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Ростокино (Бажова 26)',
  coordinates: [37.666531, 55.840936],
  description: 'Колокольчики'
}, {
  name: 'Парк «Сад Будущего» (1-я ул.Леонова, 1с1, рядом с церковью)',
  coordinates: [37.501202, 55.859843],
  description: 'Колокольчики'
}, {
  name: 'Хачатуряна, 1Б',
  coordinates: [37.558208, 55.859786],
  description: 'Колокольчики'
}, {
  name: 'Северный бульвар, д. 6',
  coordinates: [37.574826, 55.898162],
  description: 'Колокольчики'
}, {
  name: 'Пойма реки Яузы, Сельскохозяйственная, 64 стр.10',
  coordinates: [37.725712, 55.739237],
  description: 'Колокольчики'
}, {
  name: 'Пойма реки Яуза в районе Свиблово Лазоревый, 12',
  coordinates: [37.6593, 55.8637],
  description: 'Колокольчики'
}, {
  name: 'Сквер Тенистый пр-д 2к1',
  coordinates: [37.6529, 55.8702],
  description: 'Колокольчики'
}, {
  name: 'Сквер Тенистый пр-д у стадиона "Свиблово"',
  coordinates: [37.6623, 55.8649],
  description: 'Колокольчики'
}, {
  name: 'Свиблово',
  coordinates: [37.6525, 55.8565],
  description: 'Колокольчики'
}, {
  name: 'Сквер 2-й Стрелецкий пр-д',
  coordinates: [37.7206, 55.7879],
  description: 'Колокольчики'
}, {
  name: 'Стрелецкая ул. 9А',
  coordinates: [37.7181, 55.7887],
  description: 'Колокольчики'
}, {
  name: 'Алтуфьево (метро)',
  coordinates: [37.5878, 55.8981],
  description: 'Колокольчики'
}, {
  name: 'Владыкино (метро, МЦК)',
  coordinates: [37.5892, 55.8491],
  description: 'Колокольчики'
}, {
  name: 'Бабушкинская',
  coordinates: [37.6658, 55.8676],
  description: 'Колокольчики'
}, {
  name: 'Свиблово',
  coordinates: [37.6525, 55.8565],
  description: 'Колокольчики'
}, {
  name: 'Гончаровский парк (Яблочкова 1)',
  coordinates: [37.5794, 55.8577],
  description: 'Колокольчики'
}, {
  name: 'Долина реки Яуза Осташковская 23',
  coordinates: [37.7258, 55.7917],
  description: 'Колокольчики'
}, {
  name: 'Пр-д Шокальского 31к1',
  coordinates: [37.7298, 55.7859],
  description: 'Колокольчики'
}, {
  name: 'Озелененная территория по Палехской ул. от ул. Дудинка до Малыгинского проезда',
  coordinates: [37.5785, 55.8805],
  description: 'Колокольчики'
}, {
  name: 'Парк Бескудниковский бульвар 6к3',
  coordinates: [37.51238, 55.84515],
  description: 'Колокольчики'
}, {
  name: 'Парк Бескудниковский бульвар 33с2',
  coordinates: [37.50933, 55.84375],
  description: 'Колокольчики'
}, {
  name: 'Парк им. Святослава Федорова (ТПУ Селигерская)',
  coordinates: [37.56531, 55.86073],
  description: 'Колокольчики'
}, {
  name: 'Парк Воровского (4-й Новоподмосковный пер.)',
  coordinates: [37.51752, 55.84857],
  description: 'Колокольчики'
}, {
  name: 'Пешеходная зона по ул. Адмирала Макарова (ТПУ Водный стадион)',
  coordinates: [37.49117, 55.85527],
  description: 'Колокольчики'
}, {
  name: 'Войковская (метро, платформа)',
  coordinates: [37.49668, 55.81967],
  description: 'Колокольчики'
}, {
  name: 'Парк Северные дубки',
  coordinates: [37.54972, 55.87297],
  description: 'Колокольчики'
}, {
  name: 'Платформа Дегунино (ул. Дубнинская, 12бс 1)',
  coordinates: [37.55269, 55.88217],
  description: 'Колокольчики'
}, {
  name: 'Усадьба «Михалково» (Кронштадтский, 30Б)',
  coordinates: [37.44991, 55.84843],
  description: 'Колокольчики'
}, {
  name: 'Усадьба «Михалково» (Нарвская, 18)',
  coordinates: [37.48525, 55.86835],
  description: 'Колокольчики'
}, {
  name: 'Устройство пешеходной зоны, велодорожки, зона отдыха - наб. р. Лихоборки',
  coordinates: [37.56336, 55.88271],
  description: 'Колокольчики'
}, {
  name: 'Набережная Лихобороки',
  coordinates: [37.5511, 55.8443],
  description: 'Колокольчики'
}, {
  name: 'Парк на Кронштадтском бульваре',
  coordinates: [37.4876, 55.8641],
  description: 'Колокольчики'
}, {
  name: 'Сквер по Базовской ул.',
  coordinates: [37.5487, 55.8631],
  description: 'Колокольчики'
}, {
  name: 'Сквер по Базовской ул.',
  coordinates: [37.5489, 55.8631],
  description: 'Колокольчики'
}, {
  name: 'Сквер по Базовской ул.',
  coordinates: [37.5495, 55.8627],
  description: 'Колокольчики'
}, {
  name: 'Дегунинский пруд',
  coordinates: [37.5533, 55.8783],
  description: 'Колокольчики'
}, {
  name: 'Зона отдыха «Левобережный»',
  coordinates: [37.5509, 55.8456],
  description: 'Колокольчики'
}, {
  name: 'Сквер у кинотеатра «Нева»',
  coordinates: [37.5404, 55.8544],
  description: 'Колокольчики'
}, {
  name: 'Парк на Ангарской улице',
  coordinates: [37.5524, 55.8491],
  description: 'Колокольчики'
}, {
  name: 'Парк на Ангарской улице',
  coordinates: [37.5491, 55.8527],
  description: 'Колокольчики'
}, {
  name: 'Парк Вагоноремонт',
  coordinates: [37.5566, 55.8442],
  description: 'Колокольчики'
}, {
  name: 'Парк Вагоноремонт',
  coordinates: [37.5553, 55.8443],
  description: 'Колокольчики'
}, {
  name: 'Хлебниковский лесопарк',
  coordinates: [37.5075, 55.8913],
  description: 'Колокольчики'
}, {
  name: 'Карельский бульвар, 22, "Аллея Славы"',
  coordinates: [37.5546, 55.8598],
  description: 'Колокольчики'
}, {
  name: 'Мемориальный парк героев Погибель Мировой войны (Песчаная 12)',
  coordinates: [37.5332, 55.7958],
  description: 'Колокольчики'
}, {
  name: 'Мемориальный парк героев погибшей Мировой войны (Новопесчаная 12)',
  coordinates: [37.5316, 55.7955],
  description: 'Колокольчики'
}, {
  name: 'Усадьба «Грачевка» (Зеленоградская, 18А) ТПУ Ховрино',
  coordinates: [37.5149, 55.8715],
  description: 'Колокольчики'
}, {
  name: 'ВЭБ Арена',
  coordinates: [37.5623, 55.7363],
  description: 'Колокольчики'
}, {
  name: 'ул. Острякова, д.9',
  coordinates: [37.5663, 55.8076],
  description: 'Колокольчики'
}, {
  name: 'метро Аэропорт',
  coordinates: [37.5332, 55.8001],
  description: 'Колокольчики'
}, {
  name: 'Хорошевское ш., д.35А, стр.1',
  coordinates: [37.5318, 55.7989],
  description: 'Колокольчики'
}, {
  name: 'Парк «Березовая роща»',
  coordinates: [37.7444, 55.6236],
  description: 'Колокольчики'
}, {
  name: 'Парк «Гольяново»',
  coordinates: [37.821508, 55.824996],
  description: 'Колокольчики'
}, {
  name: 'Семеновский парк',
  coordinates: [37.720175, 55.789072],
  description: 'Колокольчики'
}, {
  name: 'Зона Серебряно-Виноградных прудов',
  coordinates: [37.850189, 55.794152],
  description: 'Колокольчики'
}, {
  name: 'Лесопарк Ивановский',
  coordinates: [37.846478, 55.838463],
  description: 'Колокольчики'
}, {
  name: 'Челябинская 15',
  coordinates: [37.829583, 55.752729],
  description: 'Колокольчики'
}, {
  name: 'Центр дополнительного образования детей "Черкизовский парк"',
  coordinates: [37.748578, 55.804678],
  description: 'Колокольчики'
}, {
  name: 'Благоустройство территории, охраняемой к пруду по ул. Суздальская',
  coordinates: [37.8678, 55.74389],
  description: 'Колокольчики'
}, {
  name: 'Сквер Афганцев (Зеленый проспект, д. 26)',
  coordinates: [37.819067, 55.820482],
  description: 'Колокольчики'
}, {
  name: 'Парк «Южный»',
  coordinates: [37.810141, 55.597293],
  description: 'Колокольчики'
}, {
  name: 'Сиреневый бульвар 1 к.5',
  coordinates: [37.729013, 55.610861],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Перово ЖД Кусковская ул., 2 с 1',
  coordinates: [37.7716, 55.751602],
  description: 'Колокольчики'
}, {
  name: 'Маршала Рокоссовского, 31',
  coordinates: [37.750197, 55.817077],
  description: 'Колокольчики'
}, {
  наименование: 'Пешеходная зона Измайловского проспекта от 5-ой до 15-ой Парковой ул.; м. Первомайская, выход 4, Измайловский пр-д, 75 к1',
  coordinates: [37.803203, 55.796536],
  description: 'Колокольчики'
}, {
  наименование: 'ТПУ Перово (2-я Владимирская д.41к1, д.45)',
  coordinates: [37.790188, 55.751212],
  description: 'Колокольчики'
}, {
  name: 'Лухмановский парк (Лухмановская ул., 29)',
  coordinates: [37.761954, 55.818788],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Семеновская выход 1',
  coordinates: [37.718456, 55.783067],
  description: 'Колокольчики'
}, {
  name: 'Новогиреево (метро) (Зеленый проспект д. 60/35)',
  coordinates: [37.815325, 55.751705],
  description: 'Колокольчики'
}, {
  name: 'Новогиреево (платформа) (ул. Фрязевская д.1 стр.1)',
  coordinates: [37.817676, 55.744388],
  description: 'Колокольчики'
}, {
  name: 'Черкизовская (метро, МЦК) выход №1',
  coordinates: [37.744811, 55.803754],
  description: 'Колокольчики'
}, {
  name: 'Щелковская (метро) (Щелковское ш., вл.75)',
  coordinates: [37.798753, 55.809863],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Партизанская',
  coordinates: [37.751074, 55.784088],
  description: 'Колокольчики'
}, {
  name: 'Снайперская ул., 9А',
  coordinates: [37.741658, 55.713245],
  description: 'Колокольчики'
}, {
  name: 'Вешняковская ул., 17А',
  coordinates: [37.820498, 55.731695],
  description: 'Колокольчики'
}, {
  name: 'Парк им. Артема Боровика',
  coordinates: [37.678802, 55.750862],
  description: 'Колокольчики'
}, {
  name: 'Парк 850-летия Москвы, Марьинский парк д.4',
  coordinates: [37.598019, 55.776732],
  description: 'Колокольчики'
}, {
  name: 'Парк «Дюссельдорфский»; Перервинский бульвар, 13 с1',
  coordinates: [37.606628, 55.791505],
  description: 'Колокольчики'
}, {
  name: 'Сквер по ул Полетаева д.11 ул. Федора Полетаева д.13',
  coordinates: [37.79902, 55.727935],
  description: 'Колокольчики'
}, {
  name: 'ул. Заречье д.5А, ул. Заречье д,7 стр.1',
  coordinates: [37.738405, 55.803985],
  description: 'Колокольчики'
}, {
  name: 'Сквер по адресу: Нижегородская 106',
  coordinates: [37.668822, 55.730949],
  description: 'Колокольчики'
}, {
  name: 'Ул Перерва д 12, д 8 с 1',
  coordinates: [37.606998, 55.793346],
  description: 'Колокольчики'
}, {
  name: 'Сквер у ДК "Люблино" Люблинская ул., 48, Люблинская ул., 44\\8',
  coordinates: [37.674217, 55.676486],
  description: 'Колокольчики'
}, {
  name: 'ул. Кузьминская (возле Храма, и на пересечении с ул. Юных Ленинцев)',
  coordinates: [37.76799, 55.718203],
  description: 'Колокольчики'
}, {
  name: 'ул. Тополевая аллея, д. 2 2',
  coordinates: [37.712433, 55.826485],
  description: 'Колокольчики'
}, {
  name: 'Рынок Садовод (ул. Верхние поля)',
  coordinates: [37.834456, 55.728256],
  description: 'Колокольчики'
}, {
  name: '1-й Курьяновский проезд 16 Шоссейная ул. 72 за домом у стадиона',
  coordinates: [37.729696, 55.749705],
  description: 'Колокольчики'
}, {
  name: 'Усадьба Лефортово; Красноказарменная, 1с5',
  coordinates: [37.69893, 55.761352],
  description: 'Колокольчики'
}, {
  name: 'Парк 850-летия Москвы (3 и 4 очереди); Поречная 31 А, Марьинский парк д. 1 1 ',
  coordinates: [37.687568, 55.730506],
  description: 'Колокольчики'
}, {
  name: 'Жулебинский бульвар, д.5; Хвалынский бул., 6/10',
  coordinates: [37.855536, 55.73985],
  description: 'Колокольчики'
}, {
  name: 'Белореченская д.1',
  coordinates: [37.853968, 55.737631],
  description: 'Колокольчики'
}, {
  name: 'Зона технических видов спорта (Печатники Новый парк)',
  coordinates: [37.721306, 55.68703],
  description: 'Колокольчики'
}, {
  name: 'Парк 850-летия Москвы Батайский проезд 33, Батайский проезд 37',
  coordinates: [37.68603, 55.728534],
  description: 'Колокольчики'
}, {
  name: 'Парк «Купеческие угодья» 2-я Вольская улица, 11с6 2-я Вольская улица',
  coordinates: [37.867698, 55.789329],
  description: 'Колокольчики'
}, {
  name: 'Есенинский бульвар 1/26, Есенинский бульвар 6 к.2',
  coordinates: [37.56367, 55.732078],
  description: 'Колокольчики'
}, {
  name: 'Парк Люблинское Кладбище',
  coordinates: [37.748008, 55.67028],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Метро Братиславская (метро, вблизи домов по ул. Перерва д.54, 56/2)',
  coordinates: [55.669245, 37.749271],
  description: 'Колокольчики'
}, {
  name: 'Парк Шкулёва со стороны м Волжская',
  coordinates: [37.697875, 55.758052],
  description: 'Колокольчики'
}, {
  name: 'ул. Маршала Чуйкова вл.1-3',
  coordinates: [37.829655, 55.810263],
  description: 'Колокольчики'
}, {
  name: 'ул. Привольная вл. 40-42; Самаркандский бульвар 137а, корп.1',
  coordinates: [37.746869, 55.792458],
  description: 'Колокольчики'
}, {
  name: 'МФЦ Мои Документы Капотня',
  coordinates: [37.858579, 55.621109],
  description: 'Колокольчики'
}, {
  name: 'Вблизи ул 1-й Капотнинский пр. вл. 14',
  coordinates: [37.860196, 55.621863],
  description: 'Колокольчики'
}, {
  name: 'Сквер по Есенинскому бульвару 11 к 1, ул. Юных Ленинцев д.78-82',
  coordinates: [37.810694, 55.631332],
  description: 'Колокольчики'
}, {
  name: 'Верхние поля д.2, Верхние поля д.16а',
  coordinates: [37.609173, 55.756189],
  description: 'Колокольчики'
}, {
  name: 'ул. 1-я Вольская д.11 Сквер за памятником Погибшим солдатам; 1-я Вольская улица, 13к2',
  coordinates: [37.805862, 55.734987],
  description: 'Колокольчики'
}, {
  name: 'ул. Гурьянова парк "Печатники", Гурьянова 55',
  coordinates: [37.717747, 55.680247],
  description: 'Колокольчики'
}, {
  name: 'Парк "Печатники"',
  coordinates: [37.720849, 55.683122],
  description: 'Колокольчики'
}, {
  name: 'Сквер Плющево',
  coordinates: [37.819771, 55.676408],
  description: 'Колокольчики'
}, {
  name: 'Парк на Крутицком валу',
  coordinates: [37.670325, 55.734187],
  description: 'Колокольчики'
}, {
  name: 'Парк на ул. Юных Ленинцев, coordinates: [37.849960, 55.609622]',
  description: 'Колокольчики'
}, {
  name: 'ТПУ Волгоградский проспект',
  coordinates: [37.687624, 55.727295],
  description: 'Колокольчики'
}, {
  name: 'Люблино (метро) выход 2',
  coordinates: [37.673561, 55.676462],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Волжская',
  coordinates: [37.684389, 55.692569],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Марьино',
  coordinates: [37.74916, 55.648221],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Пролетарская',
  coordinates: [37.648574, 55.731249],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Перерва',
  coordinates: [37.77887, 55.802005],
  description: 'Колокольчики'
}, {
  name: 'Дубровка (метро)',
  coordinates: [37.674826, 55.729332],
  description: 'Колокольчики'
}, {
  name: 'Кожуховская (метро)',
  coordinates: [37.679846, 55.705311],
  description: 'Колокольчики'
}, {
  name: 'Сквер и площадь у кинотеатра "Высота"',
  coordinates: [37.901753, 55.727899],
  description: 'Колокольчики'
}, {
  name: 'Текстильщики( метро)',
  coordinates: [37.717903, 55.707597],
  description: 'Колокольчики'
}, {
  name: 'Текстильщики ТПУ',
  coordinates: [37.720217, 55.708524],
  description: 'Колокольчики'
}, {
  name: 'Парк мкр. Переделкино Ближнее, ул. Анны Ахматовой, д. 2 22',
  coordinates: [37.431418, 55.636769],
  description: 'Колокольчики'
}, {
  name: 'ЖД Рассудово Парк',
  coordinates: [37.458877, 55.574223],
  description: 'Колокольчики'
}, {
  name: 'Д. Марушкино, парк «ручеёк», ГБУ ДО ТЗФ ТИНАО Парк',
  coordinates: [37.184783, 55.744138],
  description: 'Колокольчики'
}, {
  имя: 'п. Рогово, ул. Спасская (Парк им.В.Корпачёвой) Парк',
  coordinates: [37.388649, 55.608478],
  description: 'Колокольчики'
}, {
  name: 'поселок Фабрики 1 Мая д.9а Парк',
  coordinates: [37.684714, 55.630581],
  description: 'Колокольчики'
}, {
  name: 'Коммунарка, ул.Липовый Парк 9 Парк',
  coordinates: [37.356786, 55.577193],
  description: 'Колокольчики'
}, {
  name: 'Cпортивный парк «Красная Пахра» в поселении Краснопахорское',
  coordinates: [37.060497, 55.542489],
  description: 'Колокольчики'
}, {
  name: 'Троицк, ул. Солнечная, 1, 9, 6 Парк',
  coordinates: [37.311011, 55.472223],
  description: 'Колокольчики'
}, {
  name: 'Троицк Октябрьский проспект, 21Б Парк',
  coordinates: [37.301074, 55.487532],
  description: 'Колокольчики'
}, {
  name: 'Парк м.о. Воскресенское, территория вблизи домов 10, 12, 4а, 6',
  coordinates: [37.323, 55.5883],
  description: 'Колокольчики'
}, {
  name: 'Парк г. Щербинка, пос. Новомосковский, парк "Барыши"',
  coordinates: [37.5856, 55.5224],
  description: 'Колокольчики'
}, {
  name: 'Парк Поселения Кленовское, пос.Клёново, ул.Центральная, 1',
  coordinates: [38.1371, 55.5363],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Филатов Луг (метро)',
  coordinates: [37.4397, 55.6198],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Прокшино (метро)',
  coordinates: [37.4163, 55.6308],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Ольховая (метро)',
  coordinates: [37.495, 55.6176],
  description: 'Колокольчики'
}, {
  name: 'ТПУ Коммунарка (метро)',
  coordinates: [37.3583, 55.6103],
  description: 'Колокольчики'
}, {
  name: 'Парк г.Троицк, Заречная улица, 36к2, напротив д.6 по ул.Новая',
  coordinates: [37.2988, 55.4862],
  description: 'Колокольчики'
}, {
  name: 'Парк по Борисовским прудам',
  coordinates: [37.66873, 55.61071],
  description: 'Колокольчики'
}, {
  name: 'Зона отдыха Борисовские пруды',
  coordinates: [37.67537, 55.61271],
  description: 'Колокольчики'
}, {
  name: 'Зона отдыха Борисовские пруды',
  coordinates: [37.67417, 55.61225],
  description: 'Колокольчики'
}, {
  name: 'Пойма реки Городни',
  coordinates: [37.67675, 55.63216],
  description: 'Колокольчики'
}, {
  name: 'Пойма реки Городни',
  coordinates: [37.67916, 55.63405],
  description: 'Колокольчики'
}, {
  name: 'Детский парк по Загородному шоссе',
  coordinates: [37.56781, 55.62706],
  description: 'Колокольчики'
}, {
  name: 'Сквер между Борисовским проездом и Ореховым проездом',
  coordinates: [37.66669, 55.61481],
  description: 'Колокольчики'
}, {
  name: 'Сквер по ул. Медынская',
  coordinates: [37.60681, 55.62112],
  description: 'Колокольчики'
}, {
  name: 'Дорожная ул,',
  coordinates: [37.69403, 55.63598],
  description: 'Колокольчики'
}, {
  name: 'Благоустройство озелененной территории между Каширским шоссе и Шипиловским проездом',
  coordinates: [37.62239, 55.61536],
  description: 'Колокольчики'
}, {
  name: 'Парк Садовники',
  coordinates: [37.64993, 55.67064],
  description: 'Колокольчики'
}, {
  name: 'Школьный сквер',
  coordinates: [37.59415, 55.64553],
  description: 'Колокольчики'
}, {
  name: 'Школьный сквер',
  coordinates: [37.60298, 55.63791],
  description: 'Колокольчики'
}, {
  name: 'Парк Коломенская набережная, Коломенская ул., д.27',
  coordinates: [37.663769, 55.674373],
  description: 'Колокольчики'
}, {
  name: 'Парк Аршиновский парк, ул. Бакинская, д.22',
  coordinates: [37.603048, 55.617251],
  description: 'Колокольчики'
}, {
  name: 'Парк Аршиновский парк , ул. Бакинская, д.24',
  coordinates: [37.601722, 55.616996],
  description: 'Колокольчики'
}, {
  name: 'Парк Братеевский каскадный парк , ул. Борисовские пруды, д. 12,к.1',
  coordinates: [37.732958, 55.633408],
  description: 'Колокольчики'
}, {
  name: 'Парк Братеевский каскадный парк , ул. Борисовские пруды, д.44',
  coordinates: [37.732762, 55.632205],
  description: 'Колокольчики'
}, {
  name: 'Парк Народный парк "Чертановское подворье" , ул. Чертановская , д.17, кинотеатр Ашхабад',
  coordinates: [37.605797, 55.636665],
  description: 'Колокольчики'
}, {
  name: 'Парк Реализация проекта: «Реабилитация 5 прудов с благоустройством прикрытия к ним территории Бирюлевского дендропарка, ПИП «Царицыно», (ул. Липецкая, Дендропарк)',
  coordinates: [37.653508, 55.618842],
  description: 'Колокольчики'
}, {
  name: 'Парк Реализация проекта: «Реабилитация 5 прудов с благоустройством ограждения к ним территории Бирюлевского дендропарка, ПИП «Царицыно»',
  coordinates: [37.659195, 55.613676],
  description: 'Колокольчики'
}, {
  name: 'Парк Братеевская пойма (1 часть)',
  coordinates: [37.748317, 55.638156],
  description: 'Колокольчики'
}, {
  name: 'Парк Братеевская пойма (2 часть)',
  coordinates: [37.747383, 55.637864],
  description: 'Колокольчики'
}, {
  name: 'Парк Битцевский лес',
  coordinates: [37.525836, 55.59217],
  description: 'Колокольчики'
}, {
  name: 'Сквер по Кавказскому бульвару',
  coordinates: [37.540272, 55.602023],
  description: 'Колокольчики'
}, {
  name: 'Сквер по Кавказскому бульвару',
  coordinates: [37.537398, 55.605824],
  description: 'Колокольчики'
}, {
  name: 'Верхний и Нижний Бирюлевские пруды',
  coordinates: [37.588105, 55.606849],
  description: 'Колокольчики'
}, {
  name: 'Варшавские пруды',
  coordinates: [37.622745, 55.624893],
  description: 'Колокольчики'
}, {
  name: 'Варшавские пруды',
  coordinates: [37.621341, 55.625891],
  description: 'Колокольчики'
}, {
  name: 'Ореховый бульвар',
  coordinates: [37.711385, 55.618946],
  description: 'Колокольчики'
}, {
  name: 'Яблоневый сад',
  coordinates: [37.595074, 55.604236],
  description: 'Колокольчики'
}, {
  name: 'Аннинский лесопарк',
  coordinates: [37.657402, 55.620142],
  description: 'Колокольчики'
}, {
  name: 'Аннинский лесопарк',
  coordinates: [37.65807, 55.619431],
  description: 'Колокольчики'
}, {
  name: 'Детский парк по Загородному шоссе',
  coordinates: [37.442877, 55.671471],
  description: 'Колокольчики'
}, {
  name: 'Народный парк Кожухово',
  coordinates: [37.862794, 55.743373],
  description: 'Колокольчики'
}, {
  name: 'Народный парк «Кожухово»',
  coordinates: [37.863324, 55.821354],
  description: 'Колокольчики'
}, {
  name: 'Нагатинский затон',
  coordinates: [37.628662, 55.674265],
  description: 'Колокольчики'
}, {
  name: 'Пешеходная зона по Коломенской набережной',
  coordinates: [37.662307, 55.673356],
  description: 'Колокольчики'
}, {
  name: 'Верхний и Нижний Бирюлевские пруды',
  coordinates: [37.614536, 55.609131],
  description: 'Колокольчики'
}, {
  name: 'Яблоневый сад',
  coordinates: [37.631233, 55.599211],
  description: 'Колокольчики'
}, {
  name: 'Борисовский парк',
  coordinates: [37.779119, 55.654759],
  description: 'Колокольчики'
}, {
  name: 'Сквер "Родная Гавань"',
  coordinates: [37.526558, 55.741969],
  description: 'Колокольчики'
}, {
  name: 'Парк 50-летия Победы',
  coordinates: [37.604032, 55.642887],
  description: 'Колокольчики'
}, {
  name: 'Парк 50-летия Победы',
  coordinates: [37.605371, 55.640687],
  description: 'Колокольчики'
}, {
  name: 'Сквер Чингиза Айтматова',
  coordinates: [37.758425, 55.619136],
  description: 'Колокольчики'
}, {
  name: 'Варшавская (метро, платформа Коломенское)',
  coordinates: [37.653545, 55.612131],
  description: 'Колокольчики'
}, {
  name: 'Красный строитель (станция ж/д)',
  coordinates: [37.665684, 55.655573],
  description: 'Колокольчики'
}, {
  name: 'Домодедовская (метро вход, 1, выход 8)',
  coordinates: [37.717533, 55.610748],
  description: 'Колокольчики'
}, {
  name: 'Царицыно (метро, платформа)',
  coordinates: [37.669064, 55.621237],
  description: 'Колокольчики'
}, {
  name: 'Южная (метро)',
  coordinates: [37.609481, 55.622823],
  description: 'Колокольчики'
}, {
  name: 'Каширская (метро)',
  coordinates: [37.648314, 55.655617],
  description: 'Колокольчики'
}, {
  name: 'Бирюлево товарная (платформа)',
  coordinates: [37.657041, 55.580013],
  description: 'Колокольчики'
}, {
  name: 'ул. Касимовская (у остановки общественного транспорта)',
  coordinates: [37.677791, 55.638367],
  description: 'Колокольчики'
}, {
  name: 'Орехово (метро)',
  coordinates: [37.694982, 55.612428],
  description: 'Колокольчики'
}, {
  name: 'Кантемировская (метро)',
  coordinates: [37.655498, 55.636688],
  description: 'Колокольчики'
}, {
  name: 'Причал Кленовый бульвар (Нагатинская набережная, д. 40)',
  coordinates: [37.609035, 55.692772],
  description: 'Колокольчики'
}, {
  name: 'Пражская (метро, выход №5)',
  coordinates: [37.606543, 55.613857],
  description: 'Колокольчики'
}, {
  name: 'Чертаново (ж/д платформа)',
  coordinates: [37.602367, 55.639649],
  description: 'Колокольчики'
}, {
  name: 'Воронцовский парк, Воронцовские пруды, д.9',
  coordinates: [37.696329, 55.676174],
  description: 'Колокольчики'
}, {
  name: 'Воронцовский парк, ул.Новаторов, 24',
  coordinates: [37.516607, 55.836309],
  description: 'Колокольчики'
}, {
  name: 'Зона отдыха «Тропарево»',
  coordinates: [37.401206, 55.670508],
  description: 'Колокольчики'
}, {
  name: 'Зона отдыха «Тропарево»',
  coordinates: [37.407728, 55.672375],
  description: 'Колокольчики'
}, {
  name: 'Бутовский лесопарк,ул Академика Глушко,д.18',
  coordinates: [37.529054, 55.548356],
  description: 'Колокольчики'
}, {
  name: 'Зона отдыха «Новые Черемушки 10С»',
  coordinates: [37.542497, 55.672892],
  description: 'Колокольчики'
}, {
  name: 'Парк «Академический» , Проспект 60 лет Октября, д.10',
  coordinates: [37.578423, 55.899874],
  description: 'Колокольчики'
}, {
  name: 'Сквер у цирка на Вернадского',
  coordinates: [37.516235, 55.676182],
  description: 'Колокольчики'
}, {
  name: 'Парк по ул. Академика Арцимовича, д.11',
  coordinates: [37.55066, 55.648712],
  description: 'Колокольчики'
}, {
  name: 'Парк по ул. Академика Арцимовича, д.8',
  coordinates: [37.551564, 55.649449],
  description: 'Колокольчики'
}, {
  name: 'Коньково, ул. Профсоюзная , д. 2 97',
  coordinates: [37.531763, 55.643416],
  description: 'Колокольчики'
}, {
  name: 'Парк Коньково, ул. Профсоюзная, д.91',
  coordinates: [37.521047, 55.630423],
  description: 'Колокольчики'
}, {
  name: 'Парк в пойме рек Котловка, Севастопольский проспект, д.51, к.2',
  coordinates: [37.612762, 55.648772],
  description: 'Колокольчики'
}, {
  name: 'Парк в пойме рек Котловка, Нахимовский проспект, д.25А',
  coordinates: [37.607306, 55.649044],
  description: 'Колокольчики'
}, {
  name: 'ул. Генерала Тюленева, д.41А',
  coordinates: [37.49527, 55.664195],
  description: 'Колокольчики'
}, {
  name: 'ул. Варги, д.26Б',
  coordinates: [37.514812, 55.64037],
  description: 'Колокольчики'
}, {
  name: 'Сквер Гарибальди, ул. Гарибальди, д.3',
  coordinates: [37.548244, 55.703311],
  description: 'Колокольчики'
}, {
  name: 'Сквер Гарибальди, ул. Гарибальди, д.24к2',
  coordinates: [37.549441, 55.704471],
  description: 'Колокольчики'
}, {
  name: 'Сквер на улице Крупской, д.19',
  coordinates: [37.660854, 55.733135],
  description: 'Колокольчики'
}, {
  name: 'Сквер на улице Крупской, д.7',
  coordinates: [37.661799, 55.733846],
  description: 'Колокольчики'
}, {
  name: 'Сквер на улице Крупской, д.2',
  coordinates: [37.662979, 55.734578],
  description: 'Колокольчики'
}, {
  name: 'Сквер по ул. Инессы Арманд',
  coordinates: [37.57413, 55.76427],
  description: 'Колокольчики'
}, {
  name: 'Народный парк по ул. Рокотова, ул. Рокотова, д.8к2',
  coordinates: [37.493337, 55.645882],
  description: 'Колокольчики'
}, {
  name: 'ул. Обручева, д.6к3',
  coordinates: [37.548974, 55.679385],
  description: 'Колокольчики'
}, {
  name: 'ул. Саморы Машела, д.6',
  coordinates: [37.746161, 55.646618],
  description: 'Колокольчики'
}, {
  name: 'Парк Зюзино, ул. Б. Юшуньская, д.16',
  coordinates: [37.42568, 55.64006],
  description: 'Колокольчики'
}, {
  name: 'Парк 70-летия Победы, ул. Болотниковская, д.15',
  coordinates: [37.53305, 55.73068],
  description: 'Колокольчики'
}, {
  name: 'Сквер по ул. Каховка, д.19к1',
  coordinates: [37.60558, 55.64097],
  description: 'Колокольчики'
}, {
  name: 'Парк Сосенки, Нахимовский проспект, д.10',
  coordinates: [37.61517, 55.60803],
  description: 'Колокольчики'
}, {
  name: 'Парк Сосенки, Проектируемый проезд 460, д.33',
  coordinates: [37.60929, 55.60563],
  description: 'Колокольчики'
}, {
  name: 'Пойма реки Битца, Бульвар Дмитрия Донского',
  coordinates: [37.56274, 55.58147],
  description: 'Колокольчики'
}, {
  name: 'Парк в пойме реки Битца, Знаменские садки,д.1А',
  coordinates: [37.56857, 55.57683],
  description: 'Колокольчики'
}, {
  name: 'Парк в пойме реки Битца, Знаменские садки,д.11',
  coordinates: [37.57268, 55.57778],
  description: 'Колокольчики'
}, {
  name: 'Парк Южное Бутово',
  coordinates: [37.534, 55.555],
  description: 'Колокольчики'
}, {
  name: 'Чечерский проезд',
  coordinates: [37.525, 55.619],
  description: 'Колокольчики'
}, {
  name: 'Парковая зона',
  coordinates: [37.635, 55.608],
  description: 'Колокольчики'
}, {
  name: 'Сквер по ул.Руднева',
  coordinates: [37.537, 55.601],
  description: 'Колокольчики'
}, {
  name: 'Сквер по ул. Скобелевской',
  coordinates: [37.541, 55.638],
  description: 'Колокольчики'
}, {
  name: 'Бульвар линии легкого метро Бутовской линии',
  coordinates: [37.529, 55.563],
  description: 'Колокольчики'
}, {
  name: 'Комплексное благоустройство рекреационных зон района Южное Бутово',
  coordinates: [37.555, 55.552],
  description: 'Колокольчики'
}, {
  name: 'Битцевский парк (метро)',
  coordinates: [37.543, 55.583],
  description: 'Колокольчики'
}, {
  name: 'Бульвар Адмирала Ушакова (метро)',
  coordinates: [37.477, 55.56],
  description: 'Колокольчики'
}, {
  name: 'Бульвар Дмитрия Донского (метро)',
  coordinates: [37.578, 55.567],
  description: 'Колокольчики'
}, {
  name: 'Коньково (метро)',
  coordinates: [37.519, 55.633],
  description: 'Колокольчики'
}, {
  name: 'Улица Горчаково (метро)',
  coordinates: [37.527, 55.62],
  description: 'Колокольчики'
}, {
  name: 'Университет (метро)',
  coordinates: [37.53, 55.692],
  description: 'Колокольчики'
}, {
  name: 'Парк Центральный: спуск к Большому Солнцевскому пруду, у остановки',
  coordinates: [37.4446, 55.7598],
  description: 'Колокольчики'
}];

function showMarkers(category) {
  var filteredPlaces = glassRecyclingPlaces.filter(function (place) {
    return place.description === category;
  });
  filteredPlaces.forEach(function (place) {
    if (!markers.includes(place.name)) {
      markers.push(place.name);
      map.addSource(place.name, {
        type: 'geojson',
        data: {
          type: 'FeatureCollection',
          features: [{
            type: 'Feature',
            geometry: {
              type: 'Point',
              coordinates: place.coordinates
            },
            properties: {
              title: place.name,
              icon: 'marker'
            }
          }]
        }
      });
      map.addLayer({
        id: place.name,
        type: 'circle',
        source: place.name,
        paint: {
          'circle-color': 'blue',
          'circle-radius': 10
        }
      });
    }
  });
}

function hideMarkers(category) {
  var filteredPlaces = glassRecyclingPlaces.filter(function (place) {
    return place.description === category;
  });
  filteredPlaces.forEach(function (place) {
    var index = markers.indexOf(place.name);

    if (index !== -1) {
      markers.splice(index, 1);

      if (map.getLayer(place.name)) {
        map.removeLayer(place.name);
      }

      if (map.getSource(place.name)) {
        map.removeSource(place.name);
      }
    }
  });
}

categorySelector.addEventListener('change', function () {
  var category = categorySelector.value;

  if (category === 'glasss') {
    hideMarkers('Колокольчики');
    showMarkers('Стеклобой');
  } else if (category === 'bells') {
    hideMarkers('Стеклобой');
    showMarkers('Колокольчики');
  }
});
var clickCount = 0;
glassButton.addEventListener('click', function () {
  clickCount++;

  if (clickCount % 2 === 0) {
    hideMarkers('Колокольчики');
    hideMarkers('Стеклобой');
  } else {
    showMarkers('Колокольчики');
    showMarkers('Стеклобой');
  }
}); // работа со станциями метро в мск

var stationInput = document.getElementById('input');
var stationButton = document.querySelector('.A_MapPageFindButton');
stationButton.addEventListener('click', function () {
  var stationName = stationInput.value;

  if (stationName) {
    fetch('https://api.mapbox.com/geocoding/v5/mapbox.places/' + encodeURIComponent(stationName) + '.json?access_token=' + mapboxgl.accessToken).then(function (response) {
      return response.json();
    }).then(function (data) {
      if (data.features.length > 0) {
        var feature = data.features[0];
        var coordinates = feature.geometry.coordinates;
        map.flyTo({
          center: coordinates,
          zoom: 14
        });
      } else {
        alert('Станция метро не найдена!');
      }
    });
  }
});